[Killed] BlockStatement
src/operacoes.js:17:22
   return Math.sqrt(n);
 }
 function restoDivisao(dividendo, divisor) { return dividendo % divisor; }
-function fatorial(n) {
-  if (n < 0) throw new Error('Fatorial não é definido para números negativos.');
-  // Stryker disable next-line ConditionalExpression, LogicalOperator: equivalent mutant, loop also returns 1 for 0 and 1
-  if (n === 0 || n === 1) return 1;
-  let resultado = 1;
-  for (let i = 2; i <= n; i++) { resultado *= i; }
-  return resultado;
-}
+function fatorial(n) {}
 function mediaArray(numeros) {
   if (numeros.length === 0) return 0;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 8. deve calcular o fatorial de um número maior que 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: undefined

[Killed] EqualityOperator
src/operacoes.js:20:7
 function fatorial(n) {
   if (n < 0) throw new Error('Fatorial não é definido para números negativos.');
   // Stryker disable next-line ConditionalExpression, LogicalOperator: equivalent mutant, loop also returns 1 for 0 and 1
-  if (n === 0 || n === 1) return 1;
+  if (n !== 0 || n === 1) return 1;
   let resultado = 1;
   for (let i = 2; i <= n; i++) { resultado *= i; }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 8. deve calcular o fatorial de um número maior que 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: 1

[Killed] EqualityOperator
src/operacoes.js:20:18
 function fatorial(n) {
   if (n < 0) throw new Error('Fatorial não é definido para números negativos.');
   // Stryker disable next-line ConditionalExpression, LogicalOperator: equivalent mutant, loop also returns 1 for 0 and 1
-  if (n === 0 || n === 1) return 1;
+  if (n === 0 || n !== 1) return 1;
   let resultado = 1;
   for (let i = 2; i <= n; i++) { resultado *= i; }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 8. deve calcular o fatorial de um número maior que 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: 1

[Killed] BlockStatement
src/operacoes.js:84:32
   if (n <= 1) return n;
   return fibonacci(n - 1) + fibonacci(n - 2);
 }
-function produtoArray(numeros) {
-  // Stryker disable next-line ConditionalExpression: equivalent mutant, reduce with initial value also returns 1 for an empty array
-  if (numeros.length === 0) return 1;
-  return numeros.reduce((acc, val) => acc * val, 1);
-}
+function produtoArray(numeros) {}
 function clamp(valor, min, max) {
   // Stryker disable next-line EqualityOperator: equivalent mutant, valor === min returns the same value via either branch
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 35. deve calcular o produto de um array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: undefined

[Killed] EqualityOperator
src/operacoes.js:86:7
 }
 function produtoArray(numeros) {
   // Stryker disable next-line ConditionalExpression: equivalent mutant, reduce with initial value also returns 1 for an empty array
-  if (numeros.length === 0) return 1;
+  if (numeros.length !== 0) return 1;
   return numeros.reduce((acc, val) => acc * val, 1);
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 35. deve calcular o produto de um array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: 1

[Killed] BlockStatement
src/operacoes.js:89:33
   if (numeros.length === 0) return 1;
   return numeros.reduce((acc, val) => acc * val, 1);
 }
-function clamp(valor, min, max) {
-  // Stryker disable next-line EqualityOperator: equivalent mutant, valor === min returns the same value via either branch
-  if (valor < min) return min;
-  // Stryker disable next-line EqualityOperator: equivalent mutant, valor === max returns the same value via either branch
-  if (valor > max) return max;
-  return valor;
-}
+function clamp(valor, min, max) {}
 function isDivisivel(dividendo, divisor) { return dividendo % divisor === 0; }
 function celsiusParaFahrenheit(celsius) { return (celsius * 9/5) + 32; }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 36. deve manter um valor dentro de um intervalo (clamp)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: undefined

[Killed] ConditionalExpression
src/operacoes.js:91:7
 }
 function clamp(valor, min, max) {
   // Stryker disable next-line EqualityOperator: equivalent mutant, valor === min returns the same value via either branch
-  if (valor < min) return min;
+  if (false) return min;
   // Stryker disable next-line EqualityOperator: equivalent mutant, valor === max returns the same value via either branch
   if (valor > max) return max;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas Testes adicionais para matar mutantes sobreviventes deve validar numeros primos, compostos e limites
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: -5

[Killed] ConditionalExpression
src/operacoes.js:91:7
 }
 function clamp(valor, min, max) {
   // Stryker disable next-line EqualityOperator: equivalent mutant, valor === min returns the same value via either branch
-  if (valor < min) return min;
+  if (true) return min;
   // Stryker disable next-line EqualityOperator: equivalent mutant, valor === max returns the same value via either branch
   if (valor > max) return max;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 36. deve manter um valor dentro de um intervalo (clamp)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] ConditionalExpression
src/operacoes.js:93:7
   // Stryker disable next-line EqualityOperator: equivalent mutant, valor === min returns the same value via either branch
   if (valor < min) return min;
   // Stryker disable next-line EqualityOperator: equivalent mutant, valor === max returns the same value via either branch
-  if (valor > max) return max;
+  if (true) return max;
   return valor;
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 36. deve manter um valor dentro de um intervalo (clamp)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 10

[Killed] ConditionalExpression
src/operacoes.js:93:7
   // Stryker disable next-line EqualityOperator: equivalent mutant, valor === min returns the same value via either branch
   if (valor < min) return min;
   // Stryker disable next-line EqualityOperator: equivalent mutant, valor === max returns the same value via either branch
-  if (valor > max) return max;
+  if (false) return max;
   return valor;
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas Testes adicionais para matar mutantes sobreviventes deve validar numeros primos, compostos e limites
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 15

[Killed] ArithmeticOperator
src/operacoes.js:98:53
 }
 function isDivisivel(dividendo, divisor) { return dividendo % divisor === 0; }
 function celsiusParaFahrenheit(celsius) { return (celsius * 9/5) + 32; }
-function fahrenheitParaCelsius(fahrenheit) { return (fahrenheit - 32) * 5/9; }
+function fahrenheitParaCelsius(fahrenheit) { return (fahrenheit - 32) / 5/9; }
 function inverso(n) {
   if (n === 0) throw new Error('Não é possível inverter o número zero.');
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas Testes adicionais para matar mutantes sobreviventes deve validar conversoes com valores que nao mascaram operadores
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 4

[Killed] ArithmeticOperator
src/operacoes.js:107:52
 // === Bloco 5: Geometria e Lógica de Comparação (41-50) ===
 function areaCirculo(raio) { return Math.PI * Math.pow(raio, 2); }
 function areaRetangulo(base, altura) { return base * altura; }
-function perimetroRetangulo(base, altura) { return 2 * (base + altura); }
+function perimetroRetangulo(base, altura) { return 2 / (base + altura); }
 function isMaiorQue(a, b) { return a > b; }
 function isMenorQue(a, b) { return a < b; }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 43. deve calcular o perímetro de um retângulo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 18
Received: 0.2222222222222222

[Killed] EqualityOperator
src/operacoes.js:108:36
 function areaCirculo(raio) { return Math.PI * Math.pow(raio, 2); }
 function areaRetangulo(base, altura) { return base * altura; }
 function perimetroRetangulo(base, altura) { return 2 * (base + altura); }
-function isMaiorQue(a, b) { return a > b; }
+function isMaiorQue(a, b) { return a >= b; }
 function isMenorQue(a, b) { return a < b; }
 function isEqual(a, b) { return a === b; }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas Testes adicionais para matar mutantes sobreviventes deve validar os ramos falsos das checagens booleanas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArithmeticOperator
src/operacoes.js:113:46
 function isEqual(a, b) { return a === b; }
 function medianaArray(numeros) {
   if (numeros.length === 0) throw new Error('Array vazio не possui mediana.');
-  const sorted = [...numeros].sort((a, b) => a - b);
+  const sorted = [...numeros].sort((a, b) => a + b);
   const mid = Math.floor(sorted.length / 2);
   if (sorted.length % 2 === 0) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas Testes adicionais para matar mutantes sobreviventes deve calcular medianas pares e arrays desordenados
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 1
